[
  {
    "id": "Chapter-1-q1",
    "localId": "1",
    "chapter": "Chapter 1",
    "text": "Which of the following is the correct fire extinguisher class for an electrical fire?",
    "options": [
      {
        "key": "A",
        "text": "A"
      },
      {
        "key": "B",
        "text": "B"
      },
      {
        "key": "C",
        "text": "C"
      },
      {
        "key": "D",
        "text": "D"
      }
    ],
    "correctAnswer": "C",
    "explanation": "Class C is the correct fire extinguisher class for an electrical fire. **A, B,** and **D** are incorrect because they are the classes for ordinary combustible materials, flammable or combustible liquids, and chemical fires, respectively."
  },
  {
    "id": "Chapter-1-q2",
    "localId": "2",
    "chapter": "Chapter 1",
    "text": "You plan to replace the power supply in a computer. What is the most important safety measure you should take to protect yourself?",
    "options": [
      {
        "key": "A",
        "text": "Wear an antistatic wristband."
      },
      {
        "key": "B",
        "text": "Do _not_ ground yourself."
      },
      {
        "key": "C",
        "text": "Bend your knees when you lift it."
      },
      {
        "key": "D",
        "text": "Buy a name-brand power supply."
      }
    ],
    "correctAnswer": "B",
    "explanation": "The most important safety measure you should take to protect yourself is to not ground yourself, because you do not want to make your body a path for electricity to take to ground. Wearing an antistatic wristband, standing on a grounding mat, or touching something already grounded would do this and put you in danger. **A** is incorrect because this would expose you to possible electrical shock. **C** is incorrect because replacing a power supply should not require heavy lifting. **D** is incorrect because this is not a safety measure."
  },
  {
    "id": "Chapter-1-q3",
    "localId": "3",
    "chapter": "Chapter 1",
    "text": "A client has a large CRT monitor. It is malfunctioning, and none of the external buttons on the monitor help, nor can you fix it using the Properties settings in Windows. Although the monitor is quite old, the client likes it, and wants it to be repaired if possible. What should you do?",
    "options": [
      {
        "key": "A",
        "text": "Open the CRT case and visually inspect for a loose connection."
      },
      {
        "key": "B",
        "text": "Take it to a qualified repair center."
      },
      {
        "key": "C",
        "text": "Tell the client the monitor is beyond repair and immediately discard it."
      },
      {
        "key": "D",
        "text": "Find a service manual for it online and try to repair it yourself."
      }
    ],
    "correctAnswer": "B",
    "explanation": "Take it to a qualified repair center. **A** is incorrect because it is dangerous to open a CRT, and only highly trained technicians should open a CRT case. **C** is incorrect because this is an extreme reaction until you know more about the nature of the problem and whether the CRT can be repaired. If it cannot, then recycle it, rather than “discard” it. **D** is also incorrect until you have more information about the problem and whether the CRT can be repaired. If you cannot get it repaired, then you will need to recycle it."
  },
  {
    "id": "Chapter-1-q4",
    "localId": "4",
    "chapter": "Chapter 1",
    "text": "What should you do before moving any computer equipment?",
    "options": [
      {
        "key": "A",
        "text": "Power down and disconnect the power cord."
      },
      {
        "key": "B",
        "text": "Wear work gloves."
      },
      {
        "key": "C",
        "text": "Put on a facemask."
      },
      {
        "key": "D",
        "text": "Remove the power supply."
      }
    ],
    "correctAnswer": "A",
    "explanation": "**A.** Power down and disconnect the power cord before moving any computer equipment. **B** is incorrect because you only need to wear gloves when you are moving something with sharp edges, and not all computer equipment has sharp edges. **C** is incorrect because a facemask is only needed if you expect to be exposed to airborne particles. **D** is incorrect because this is a very extreme and unnecessary action to take before moving computer equipment."
  },
  {
    "id": "Chapter-1-q5",
    "localId": "5",
    "chapter": "Chapter 1",
    "text": "When should you wear an air filtration mask and goggles?",
    "options": [
      {
        "key": "A",
        "text": "When changing a toner cartridge"
      },
      {
        "key": "B",
        "text": "When using compressed air to clean dust out of a PC case"
      },
      {
        "key": "C",
        "text": "When installing RAM"
      },
      {
        "key": "D",
        "text": "When disassembling a monitor"
      }
    ],
    "correctAnswer": "B",
    "explanation": "**B.** Compressed air is likely to stir up dust and other debris that could get in your eyes and lungs. Protect yourself with a mask and goggles. **A** is incorrect because changing a toner cartridge is not likely to release much toner into the air. **C** is incorrect because installing RAM is not likely to stir up any airborne contaminants. **D** is incorrect because disassembling a monitor would not likely stir up airborne contaminants (and you should not be disassembling a monitor anyway)."
  },
  {
    "id": "Chapter-1-q6",
    "localId": "6",
    "chapter": "Chapter 1",
    "text": "Which of these is _not_ good advice for safe lifting and moving?",
    "options": [
      {
        "key": "A",
        "text": "Carry the item close to your body."
      },
      {
        "key": "B",
        "text": "Bend your knees."
      },
      {
        "key": "C",
        "text": "Use a fast, jerking movement to pick up a heavy object."
      },
      {
        "key": "D",
        "text": "Keep your back straight and vertical to the floor."
      }
    ],
    "correctAnswer": "C",
    "explanation": "**C.** You should lift with a slow, smooth movement, not fast and jerking. **A** is incorrect because you should carry the item close to your body. **B** is incorrect because bending your knees is recommended to avoid stressing your back. **D** is incorrect because your back should be as straight and as vertical to the floor as possible."
  },
  {
    "id": "Chapter-1-q7",
    "localId": "7",
    "chapter": "Chapter 1",
    "text": "Which statement is _not_ true about ESD?",
    "options": [
      {
        "key": "A",
        "text": "ESD can kill a human."
      },
      {
        "key": "B",
        "text": "As little as 30 volts of ESD can damage a device."
      },
      {
        "key": "C",
        "text": "You can damage equipment via ESD without feeling any electrical shock yourself."
      },
      {
        "key": "D",
        "text": "Low humidity makes ESD more likely."
      }
    ],
    "correctAnswer": "A",
    "explanation": "**A.** ESD may be high voltage, but due to the low amperage, it cannot kill a person, although it can startle. **B, C,** and **D** are incorrect because they are all true statements."
  },
  {
    "id": "Chapter-1-q8",
    "localId": "8",
    "chapter": "Chapter 1",
    "text": "What can you use to protect a PC from power sags?",
    "options": [
      {
        "key": "A",
        "text": "Surge suppressor"
      },
      {
        "key": "B",
        "text": "Power supply"
      },
      {
        "key": "C",
        "text": "UPS"
      },
      {
        "key": "D",
        "text": "APS"
      }
    ],
    "correctAnswer": "C",
    "explanation": "**C.** A UPS will protect a PC from power sags because it provides conditioned power, free from the surges, spikes, and sags coming from the power company. **A** is incorrect because a surge suppressor only protects from power surges, not from power sags. **B** is incorrect because a power supply does not protect a PC from power sags. **D** is incorrect because APS is not a standard acronym for a power protection device."
  },
  {
    "id": "Chapter-1-q9",
    "localId": "9",
    "chapter": "Chapter 1",
    "text": "What is the ideal environment for ESD to occur?",
    "options": [
      {
        "key": "A",
        "text": "Hot and humid"
      },
      {
        "key": "B",
        "text": "Cold and humid"
      },
      {
        "key": "C",
        "text": "Hot and dry"
      },
      {
        "key": "D",
        "text": "Cold and dry"
      }
    ],
    "correctAnswer": "D",
    "explanation": "**D.** Cold and dry is the ideal environment for ESD to occur. This should be avoided because ESD can damage equipment. **A, B,** and **C** are incorrect because none of these is as ideal an environment for ESD as is a cold and dry environment."
  },
  {
    "id": "Chapter-1-q10",
    "localId": "10",
    "chapter": "Chapter 1",
    "text": "You are getting ready to install a new component, a memory stick that came in its own antistatic bag. What is the correct way to handle this component and the bag?",
    "options": [
      {
        "key": "A",
        "text": "Remove the component from the bag and place it on top of the bag until ready to install."
      },
      {
        "key": "B",
        "text": "Remove the component from the bag and immediately discard the bag."
      },
      {
        "key": "C",
        "text": "Leave the component in the bag until you are ready to install it."
      },
      {
        "key": "D",
        "text": "Remove the component from the bag and turn the bag inside out before placing the component on the bag."
      }
    ],
    "correctAnswer": "C",
    "explanation": "**C.** Leave the component in the bag until you are ready to install it. **A** is incorrect because the outside of the bag may hold a static charge. **B** is incorrect because you may want to reuse the bag if you need to store this or another component at some time. **D** is incorrect because this procedure is not recommended and could expose the component to ESD."
  },
  {
    "id": "Chapter-1-q11",
    "localId": "11",
    "chapter": "Chapter 1",
    "text": "When cleaning dirty items with compressed air, what safety equipment should you wear?",
    "options": [
      {
        "key": "A",
        "text": "Mouth/nose mask and gloves"
      },
      {
        "key": "B",
        "text": "Mouth/nose mask and goggles"
      },
      {
        "key": "C",
        "text": "An apron or protective jacket"
      },
      {
        "key": "D",
        "text": "Steel-toed shoes"
      }
    ],
    "correctAnswer": "B",
    "explanation": "**B.** A mouth/nose mask will keep you from breathing any debris or dust, and goggles will keep debris out of your eyes. **A** is incorrect because gloves are not important to wear for this task. **C** is incorrect because an apron or jacket would protect your clothing, but not your body. **D** is incorrect because steel-toed shoes would not be useful for protecting against dust and debris."
  },
  {
    "id": "Chapter-1-q12",
    "localId": "12",
    "chapter": "Chapter 1",
    "text": "In what way could compressed air harm a human body?",
    "options": [
      {
        "key": "A",
        "text": "Alkaline burns"
      },
      {
        "key": "B",
        "text": "Acid burns"
      },
      {
        "key": "C",
        "text": "Heat burns"
      },
      {
        "key": "D",
        "text": "Freeze burns"
      }
    ],
    "correctAnswer": "D",
    "explanation": "**D.** Compressed air gets very cold when released and could cause a freeze burn. **A** and **B** are incorrect because compressed air does not contain alkaline or acid. **C** is incorrect because compressed air does not generate heat when released."
  },
  {
    "id": "Chapter-1-q13",
    "localId": "13",
    "chapter": "Chapter 1",
    "text": "When a computer system is no longer functioning and is not repairable, how should you dispose of it?",
    "options": [
      {
        "key": "A",
        "text": "Put it in the trash."
      },
      {
        "key": "B",
        "text": "Donate it to a charity."
      },
      {
        "key": "C",
        "text": "Send it to a recycling center."
      },
      {
        "key": "D",
        "text": "Send it to a landfill."
      }
    ],
    "correctAnswer": "C",
    "explanation": "**C.** Send it to a recycling center. Even a nonfunctioning computer has material in it that can and should be recycled. **A** is incorrect because something put into the trash will usually end up in a landfill (see response to **D**). **B** is incorrect because donating something that is beyond repair is not ethical and is passing on the responsibility for disposing of the computer. **D** is incorrect because computers contain components that can contaminate the environment and components that should be recycled."
  },
  {
    "id": "Chapter-1-q14",
    "localId": "14",
    "chapter": "Chapter 1",
    "text": "You do not know the proper handling of an old solvent previously used in your company, and now you need to discard it. How can you find out more about it?",
    "options": [
      {
        "key": "A",
        "text": "Contact the manufacturer and ask for an MSDS."
      },
      {
        "key": "B",
        "text": "Send it to a recycling center."
      },
      {
        "key": "C",
        "text": "Transfer it to a glass jar for safe storage."
      },
      {
        "key": "D",
        "text": "Call 911."
      }
    ],
    "correctAnswer": "A",
    "explanation": "**A.** Contact the manufacturer and ask for an MSDS (or SDS) because this document will contain instructions on safe handling and safe disposal of the chemical. **B** is incorrect, although this is what you may ultimately do. You first need to know how to safely handle the chemical. **C** is incorrect because no information is available to lead you to believe the original container is not adequate. **D** is incorrect because there is no emergency."
  },
  {
    "id": "Chapter-1-q15",
    "localId": "15",
    "chapter": "Chapter 1",
    "text": "What should you do with a large number of used batteries accumulated in your office?",
    "options": [
      {
        "key": "A",
        "text": "Dispose of them in the trash."
      },
      {
        "key": "B",
        "text": "Find a recycling center that will accept them."
      },
      {
        "key": "C",
        "text": "Send them back to the manufacturers."
      },
      {
        "key": "D",
        "text": "Let them accumulate and dispose of them about once a year."
      }
    ],
    "correctAnswer": "B",
    "explanation": "**B.** Find a recycling center that will accept batteries. **A** is incorrect because you should never throw batteries in the trash. They contain environmentally dangerous components and chemicals. **C** is incorrect in general. Some manufacturers may have a program for used batteries, but first locate a recycling center. **D** is incorrect because batteries stored for long periods can leak toxic chemicals."
  },
  {
    "id": "Chapter-1-q16",
    "localId": "16",
    "chapter": "Chapter 1",
    "text": "Which of the following protects against blackouts?",
    "options": [
      {
        "key": "A",
        "text": "Power strip"
      },
      {
        "key": "B",
        "text": "Surge suppressor"
      },
      {
        "key": "C",
        "text": "Inverter"
      },
      {
        "key": "D",
        "text": "UPS"
      }
    ],
    "correctAnswer": "D",
    "explanation": "**D.** A UPS is an online power protection device and protects against blackouts. **A** is incorrect because this provides no power protection whatsoever. **B** is incorrect because a surge suppressor only protects against power surges and is not an online power protection device in the way that a UPS is, providing full-time power from the battery. **C** is incorrect because an inverter takes low-voltage DC power and transforms it to 110V 60-cycle AC output."
  },
  {
    "id": "Chapter-1-q17",
    "localId": "17",
    "chapter": "Chapter 1",
    "text": "What unit of measurement describes a surge suppressor’s ability to protect from power surges?",
    "options": [
      {
        "key": "A",
        "text": "VA"
      },
      {
        "key": "B",
        "text": "Watts"
      },
      {
        "key": "C",
        "text": "ULs"
      },
      {
        "key": "D",
        "text": "Joules"
      }
    ],
    "correctAnswer": "D",
    "explanation": "**D.** Joules describes the protection level provided by a surge suppressor. **A** is incorrect because VA stands for volts/amps. It is a measure of the ability of a UPS to provide power. **B** is incorrect because wattage is a measurement of power consumption. **C** is incorrect because UL stands for Underwriters Laboratory, an agency that certifies electrical equipment’s safety and performance."
  },
  {
    "id": "Chapter-1-q18",
    "localId": "18",
    "chapter": "Chapter 1",
    "text": "Which of these is a metal that a battery might contain, requiring special disposition of it?",
    "options": [
      {
        "key": "A",
        "text": "Lithium"
      },
      {
        "key": "B",
        "text": "Helium"
      },
      {
        "key": "C",
        "text": "Hydrogen"
      },
      {
        "key": "D",
        "text": "Calcium"
      }
    ],
    "correctAnswer": "A",
    "explanation": "**A.** Lithium batteries are common in mobile devices, and lithium requires recycling, not disposal in the regular trash. **B, C,** and **D** are incorrect because helium, hydrogen, and calcium are not metals, nor are they hazardous to the environment."
  },
  {
    "id": "Chapter-1-q19",
    "localId": "19",
    "chapter": "Chapter 1",
    "text": "What is it about a circuit board that makes it subject to special disposal procedures?",
    "options": [
      {
        "key": "A",
        "text": "Plastic"
      },
      {
        "key": "B",
        "text": "Lead"
      },
      {
        "key": "C",
        "text": "Aluminum"
      },
      {
        "key": "D",
        "text": "Steel"
      }
    ],
    "correctAnswer": "B",
    "explanation": "**B.** Lead is a soft metal that is used in the solder points on a circuit board. Lead can leach into soil in a landfill, unlike harder metals. **A** is incorrect because although plastic can harm the environment, it does not contaminate the soil it comes in contact with, as lead does. **C** and **D** are incorrect because aluminum and steel are not used in circuit boards, and they are also not environmentally hazardous."
  },
  {
    "id": "Chapter-1-q20",
    "localId": "20",
    "chapter": "Chapter 1",
    "text": "What is the best way to recycle a cell phone?",
    "options": [
      {
        "key": "A",
        "text": "Hazardous waste collection facility"
      },
      {
        "key": "B",
        "text": "Put in the regular trash"
      },
      {
        "key": "C",
        "text": "Buy-back program"
      },
      {
        "key": "D",
        "text": "Burn it"
      }
    ],
    "correctAnswer": "C",
    "explanation": "**C.** A buy-back program is the best option because it will pay you for the phone. **A** is incorrect because although this is a responsible method of disposal, it pays nothing. **B** is incorrect because a phone should not be put in the regular trash because of the environmentally hazardous components in its battery and circuit boards. **D** is incorrect because burning plastic might generate toxic fumes and eliminates any possibility of recycling any of the parts."
  }
]